app/controllers/messages_controller.rb

  def index
    @user = []
    @user = User.find(params[:user_id]) if params[:user_id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def create
    @message = Message.create!(params[:message])
---
INSERT INTO `messages` (`created_at`, `text`, `updated_at`, `username`) VALUES ('2012-04-18 12:07:30', 'test', '2012-04-18 12:07:30', NULL)