app/controllers/users_controller.rb

  def create
    @user = User.create!(params[:user])
---
INSERT INTO `users` (`created_at`, `name`, `updated_at`) VALUES ('2012-04-18 13:09:07', 'aulia2', '2012-04-18 13:09:07')